In [16]:
import pandas as pd
import seaborn as sns
import numpy as np
col = ['col1','col2','col3','col4','col5']
row = ['row1','row2','row3','row4','row5']
na = np.nan

from pandas import Series, DataFrame

raw_data = {'col0': [1, 2, 3, 4],
            'col1': [10, 20, 30, 40],
            'col2': [100, 200, 300, 400]}

df = DataFrame(data,row,col)
print(df)

   col0  col1  col2
0     1    10   100
1     2    20   200
2     3    30   300
3     4    40   400

In [20]:
df.fillna(value=dict)

   col0  col1  col2
0     1    10   100
1     2    20   200
2     3    30   300
3     4    40   400

In [21]:
df.fillna(method='bfill') #fill

   col0  col1  col2
0     1    10   100
1     2    20   200
2     3    30   300
3     4    40   400

In [23]:
df.fillna(method='ffill') #Nan is not number

   col0  col1  col2
0     1    10   100
1     2    20   200
2     3    30   300
3     4    40   400

In [28]:
print(df.fillna('A',limit=3, axis=0))

   col0  col1  col2
0     1    10   100
1     2    20   200
2     3    30   300
3     4    40   400